/*
----------------------------------------------------
题目：求多项式1-1/2+1/3-1/4+...+1/99-1/100的值 
----------------------------------------------------
*/
#include "stdio.h"

int main (void){
	int sign = 1;
	double deno = 2.0, sum = 1.0, term;
	while (deno <= 100){
		sign = -sign;
		term = sign / deno;
		sum = sum + term;
		deno = deno + 1;
	}
	printf ("%f\n", sum);
	
	return 0;
} 
/*
------------------------------------------------------
在Dev终端输入结果： 
0.688172

--------------------------------
Process exited after 0.3318 seconds with return value 0
请按任意键继续. . .
 
------------------------------------------------------
*/
