/*
---------------------------------------------
题目：计算利息，有1000元，想存一年。三种存钱方法
1.活期，年利率为r1
2.一年定期，年利率为r2
3.存俩次半年定期，年利率为r3
分别计算出3中方法得到的本息之和 
---------------------------------------------
*/
#include "stdio.h"

int main (void){
	float p0 = 1000, r1 = 0.0036, r2 = 0.0225, r3 = 0.01988, p1, p2, p3;	
	p1 = p0 * (1 + r1);
	p2 = p0 * (1 + r2);
	p3 = p0 * (1 + r3 / 2) * (1 + r3 / 2);
	printf ("p1 = %f\np2 = %f\np3 = %f\n", p1, p2, p3);
	
	return 0;
} 
/*
------------------------------------------------
在Dev终端输入结果： 
p1 = 1003.599976
p2 = 1022.500061
p3 = 1019.978821

--------------------------------
Process exited after 3.238 seconds with return value 0
请按任意键继续. . . 
------------------------------------------------
*/
