/*
------------------------------------------------
题目：输入俩个实数，由大到小输出这俩个数字。 
------------------------------------------------
*/ 
#include "stdio.h"

int main (void){
	float a, b, t;
	scanf ("%f%f", &a, &b);
	if (a > b){
		t = a;
		a = b;
		b = t;
	}
	printf ("%5.2f, %5.2f\n", a, b);
	
	return 0;
} 
/*
----------------------------------------------------
在Dev终端输入结果： 
3.4 -4
-4.00,  3.40

--------------------------------
Process exited after 21.25 seconds with return value 0
请按任意键继续. . . 
----------------------------------------------------
*/
