/*
-------------------------------------------------------------------- 
题目：输入一个字符，判断它是否为大写字母，如果是将他转换为小写字母 ，
不是不转换。输出最后得到的字符。 
-------------------------------------------------------------------- 
*/
#include "stdio.h"

int main (void){
	char ch;
	scanf ("%c", &ch);
	ch = (ch >= 'A' && ch <= 'Z') ? (ch + 32) : ch;
	printf ("%c\n", ch);
	
	return 0;
}
/*
----------------------------------------------------------------------
在Dev终端输入结果： 
d
d

--------------------------------
Process exited after 3.037 seconds with return value 0
请按任意键继续. . .
A
a

--------------------------------
Process exited after 4.034 seconds with return value 0
请按任意键继续. . . 
----------------------------------------------------------------------
*/ 
