/*
---------------------------------------------
题目：求俩个整数之和。 
---------------------------------------------
*/
#include "stdio.h"

int main (void){
	int a, b, sum;
	a = 123;
	b = 456;
	sum = a + b;
	printf ("sum is %d\n", sum);
	
	return 0;
} 
/*
------------------------------------------------------------ 
在Dev终端输入结果：  
sum is 579

--------------------------------
Process exited after 0.3096 seconds with return value 0
请按任意键继续. . .

----------------------------------------------------------- 
*/ 
