/*
-------------------------------------------------- 
题目：在屏幕上输出以下信息： This is a C program
-------------------------------------------------- 
*/
#include "stdio.h"

int main (void){
	printf ("This is a C program.\n");
	
	return 0;
}
/*
-------------------------------------------------------------- 
在Dev终端输入结果： 
This is a C program.

--------------------------------
Process exited after 0.3012 seconds with return value 0
请按任意键继续. . . 
-------------------------------------------------------------- 
*/ 
