/*
------------------------------------------------------------------------ 
题目：有一个阶跃函数： 
				若x<0，则y=-1；
				若x=0，	则y=0；
				若x>0，则y=1； 
输入x值，要求输出其相应的y值。 
------------------------------------------------------------------------
*/ 
#include "stdio.h"

int main (void){
	int x, y;
	printf ("input nums x:\t");
	scanf ("%d", &x);
	/*
	if (x < 0)
		y = -1;
	else 
		if (x == 0)
			y = 0;
		else 
		    y = 1;
	*/
	if (x >= 0)
		if (x > 0)
			y = 1;
		else 
			y = 0;
	else 
		y = -1;
	printf ("x = %d\t y = %d\t", x, y);
	
	return 0;
} 
/*
-----------------------------------------------------------------------
在Dev终端输入结果： 
input nums x:   3
x = 3    y = 1
--------------------------------
Process exited after 3.754 seconds with return value 0
请按任意键继续. . .
 
-----------------------------------------------------------------------
*/
