/*
------------------------------------------- 
题目：输入三个数字，有小到大顺序输出 
------------------------------------------- 
*/
#include "stdio.h" 

int main (void){
	float a, b, c, t;
	scanf ("%f%f%f", &a, &b, &c);
	if (a > b){
		t = a;
		a = b;
		b = t;
	}
	if (a > c){
		t = a;
		a = c;
		c = t;
	}
	if (b > c){
		t = b;
		b = c;
		c = t;
	}
	printf ("%5.2f%5.2f%5.2f", a, b, c);
	
	return 0;
}
/*
------------------------------------------------
在Dev终端输入结果： 
2 7 4
 2.00 4.00 7.00
--------------------------------
Process exited after 6.171 seconds with return value 0
请按任意键继续. . .
------------------------------------------------
*/
