/*
---------------------------------------------------------
题目：求ax^2+bx+c=0方程的根，a,b,c自己输入，且b^2-4ac>0 
---------------------------------------------------------
*/
#include "stdio.h"
#include "math.h"

int main (void){
	double a, b, c, disc, x1, x2, p, q;
	scanf ("%lf%lf%lf", &a, &b, &c);//%lf表示双精度 
	disc = b * b - 4 * a * c;
	p = -b / (2.0 * a);
	q = sqrt (disc) / (2.0 * a);
	x1 = p + q;
	x2 = p - q;
	printf ("x1 = %7.2f\nx2 = %7.2f\n", x1, x2);//指定数据占7列，其中小数占2列 
	
	return 0;
}
/*
---------------------------------------------------------
在Dev终端输入结果： 
1 3 2
x1 =   -1.00
x2 =   -2.00

--------------------------------
Process exited after 2.734 seconds with return value 0
请按任意键继续. . . 
---------------------------------------------------------
*/ 
 
